# BoundaryCurves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Opening..::..BoundaryCurves Property
Opening Class See Also
---
The geometry information for non-rectangular openings in project documents, or for all openings in family documents.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArray BoundaryCurves { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BoundaryCurves As CurveArray
	Get
```

Visual C++
---
```text
public:
property CurveArray^ BoundaryCurves {
	CurveArray^ get ();
}
```

# Remarks
If IsRectBoundary is true, this value is nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
Opening Class
Autodesk.Revit.DB Namespace